#            [Київ] (Старт, dist=0)
#           /      \
#     (2 год)      (3 год)
#         /          \
#    [Житомир]     [Черкаси]
#       |             |
#    (2 год)       (3 год)
#         \          /
#        [Вінниця] (dist=4)
#             |
#          (1 год)
#             |
#       [Хмельницький] (Загальний час: 5 год)

# graph = {
#     "Київ": {"Житомир": 2 , "Черкаси": 3},
#     "Житомир": {"Київ": 2 , "Вінниця": 2},
#     "Черкаси": {"Київ": 2 , "Вінниця": 3},
#     "Вінниця": {"Хмельницький": 1 , "Житомир": 2,"Черкаси": 3},
#     "Хмельницький": {"Вінниця": 1},
# }
graph = {
    "Харків": {"Київ": 2,"Полтава": 2,"Луганськ": 3},
    "Київ": {"Полтава": 1,"Дніпро": 3},
    "Полтава": {"Дніпро": 2,"Луганськ": 1},
    "Дніпро": {"Херсон": 2,"Донецьк": 2},
    "Херсон": {"Донецьк": 4,"Київ": 1},
    "Луганськ": {"Суми": 3,"Харків": 3, "Полтава": 1},
    "Суми": {"Луганськ": 3},
    "Донецьк": {"Дніпро": 2, "Херсон": 4}
}

import heapq

def dijkstra(graph, start):
    distances = {node: float('inf') for node in graph}
    distances[start] = 0

    priority_queue = [(0, start)]

    previous_nodes = {node: None for node in graph}

    while priority_queue:
        current_distance, current_node = heapq.heappop(priority_queue)

        if current_distance > distances[current_node]:
            continue

        for neighbor, weight in graph[current_node].items():
            distance = current_distance + weight

            if distance < distances[neighbor]:
                distances[neighbor] = distance
                previous_nodes[neighbor] = current_node
                heapq.heappush(priority_queue, (distance, neighbor))

    return distances, previous_nodes


def get_path(previous_nodes, target):
    path = []
    current = target
    while current is not None:
        path.append(current)
        current = previous_nodes[current]
    return path[::-1]

# distances, previous_nodes = dijkstra(graph, "Харків")
# path = get_path(previous_nodes, "Суми")
# # print ("Найкоротший маршрут:", " - ". join(path))
# print("Найкоротший маршрут:", " -> ".join(path), ", всього", distances["Суми"], "год")

# ЗАДАЧА 1. АВТОМОБІЛЬНИЙ МАРШРУТ МІСТАМИ УКРАЇНИ
# Київ -> Житомир (2)
# Київ -> Черкаси (3)
# Житомир -> Вінниця (2)
# Житомир -> Хмельницький (4)
# Черкаси -> Вінниця (3)
# Черкаси -> Дніпро (5)
# Вінниця -> Хмельницький (1)

# graph = {
#     "Київ": {"Житомир": 2, "Черкаси": 3 },
#     "Житомир": {"Вінниця": 2, "Хмельницький": 4},
#     "Черкаси": {"Вінниця": 3, "Дніпро": 5},
#     "Вінниця": {"Хмельницький": 1, "Черкаси": 1, "Житомир": 2},
#     "Хмельницький": {"Вінниця": 1},
#     "Дніпро": {"Черкаси": 5}
# }

# ЗАДАЧА 2. ОПТИМІЗАЦІЯ ВИТРАТ МАНИ В RPG-ГРІ
# Старт -> Ліс (5)
# Старт -> Печера (10)
# Ліс -> Болота (3)
# Ліс -> Замок (8)
# Печера -> Замок (2)
# Болота -> Бос (6)
# Замок -> Бос (1)

# graph = {
#     "Старт": {"Ліс": 5, "Печера": 10 },
#     "Ліс": {"Болота": 3, "Старт": 5},
#     "Печера": {"Замок": 8, "Старт": 10},
#     "Болота": {"Бос": 6, "Ліс": 3},
#     "Замок": {"Бос": 1, "Замок": 8},
#     "Бос": {"Болота": 6, "Замок": 1}
# }

# ЗАДАЧА 3. МІЖМІСЬКІ ПЕРЕВЕЗЕННЯ
# Харків -> Київ (2)
# Харків -> Полтава (2)
# Харків -> Луганськ (3)
# Київ -> Полтава (1)
# Київ -> Дніпро (3)
# Полтава -> Дніпро (2)
# Полтава -> Луганськ (1)
# Дніпро -> Херсон (2)
# Дніпро -> Донецьк (2)
# Херсон -> Донецьк (4)
# Луганськ -> Суми (3)
# Херсон -> Київ (1)

# graph = {
#     "Харків": {"Київ": 2,"Полтава": 2,"Луганськ": 3},
#     "Київ": {"Полтава": 1,"Дніпро": 3},
#     "Полтава": {"Дніпро": 2,"Луганськ": 1},
#     "Дніпро": {"Херсон": 2,"Донецьк": 2},
#     "Херсон": {"Донецьк": 4,"Київ": 1},
#     "Луганськ": {"Суми": 3},
#     "Суми": {},
#     "Донецьк": {}
# }

# ЗАДАЧА 4. ОПТИМІЗАЦІЯ ДОРОЖНЬОЇ МЕРЕЖІ
# Київ -> Житомир (2)
# Київ -> Дніпро (3)
# Житомир -> Вінниця (1)
# Дніпро -> Львів (5)
# Дніпро -> Донецьк (2)
# Вінниця -> Одеса (3)
# Львів -> Ужгород (2)
# Донецьк -> Харків (1)
# Харків -> Київ (2)
# Херсон -> Одеса (1)
# Львів -> Чернівці (3)
# Одеса -> Ужгород (4)

# graph = {
# "Київ": {"Житомир": 2, "Дніпро": 3},
# "Житомир": {"Вінниця": 1},
# "Дніпро": {"Львів": 5, "Донецьк" : 2},
# "Вінниця": {"Одеса": 3},
# "Львів": {"Ужгород": 2},
# "Донецьк": {"Харків": 1},
# "Харків": {"Київ": 2},
# "Херсон": {"Одеса": 1},
# "Львів": {"Чернівці": 3},
# "Одеса": {"Ужгород": 4},
# "Ужгород": {"Львів": 2, "Одеса": 4},
# "Чернівці": {"Львів": 3}
# }
# distances, previous_nodes = dijkstra(graph, "Київ")
# path = get_path(previous_nodes, "Ужгород")
# print(f"Час поїздки: {distances["Ужгород"]} год")
# print(f"Шлях поїздки: {' -> '.join (path)}")

# ЗАДАЧА 5. МЕРЕЖА ДОСТАВКИ ІНТЕРНЕТ-ПАКЕТІВ
# Київ -> Львів (3)
# Київ -> Дніпро (2)
# Київ -> Одеса (4)
# Львів -> Харків (5)
# Львів -> Житомир (2)
# Дніпро -> Харків (2)
# Дніпро -> Донецьк (3)
# Дніпро -> Одеса (3)
# Львів -> Чернівці (4)
# Харків -> Луганськ (2)
# Харків -> Полтава (2)
# Одеса -> Херсон (2)
# Одеса -> Миколаїв (3)
# Житомир -> Вінниця (2)
# Вінниця -> Хмельницький (2)
# Хмельницький -> Тернопіль (2)
# Хмельницький -> Чернівці (3)
# Тернопіль -> Львів (2)
# Херсон -> Донецьк (4)
# Миколаїв -> Донецьк (4)
# Миколаїв -> Херсон (1)
# Полтава -> Кременчук (3)
# Полтава -> Черкаси (2)
# Черкаси -> Кропивницький (2)
# Черкаси -> Вінниця (3)
# Кременчук -> Дніпро (3)
# Кременчук -> Полтава (2)
# Донецьк -> Луганськ (2)
# Донецьк -> Харків (3)
# Донецьк -> Запоріжжя (2)
# Харків -> Суми (3)
# Луганськ -> Северодонецьк (2)
# Херсон -> Миколаїв (1)
# Донецьк -> Маріуполь (3)
# Запоріжжя -> Маріуполь (2)
# Львів -> Ужгород (4)
# Чернівці -> Ужгород (3)
# Тернопіль -> Івано-Франківськ (2)
# Івано-Франківськ -> Львів (3)
# Івано-Франківськ -> Чернівці (3)
# Кропивницький -> Черкаси (2)
# Кропивницький -> Полтава (2)
# Полтава -> Суми (3)
# Суми -> Кременчук (4)
# Суми -> Харків (4)
# Луганськ -> Харків (2)
# Луганськ -> Северодонецьк (2)
# Харків -> Полтава (2)
# Полтава -> Дніпро (3)
# Дніпро -> Одеса (3)
# Дніпро -> Запоріжжя (2)
# Запоріжжя -> Мелітополь (2)
# Запоріжжя -> Маріуполь (3)
# Маріуполь -> Донецьк (3)
# Херсон -> Миколаїв (1)
# Миколаїв -> Одеса (3)
# Хмельницький -> Вінниця (2)
# Вінниця -> Житомир (2)
# Житомир -> Київ (2)
# Тернопіль -> Львів (2)
# Львів -> Чернівці (4)
# Чернівці -> Вінниця (4)
# Чернівці -> Хмельницький (3)
# Київ -> Житомир (2)
# Київ -> Дніпро (2)
# Київ -> Одеса (4)
# Львів -> Харків (5)
# Львів -> Житомир (2)
# Дніпро -> Харків (2)
# Дніпро -> Донецьк (3)
# Дніпро -> Одеса (3)
# Львів -> Чернівці (4)
# Харків -> Луганськ (2)
# Харків -> Полтава (2)
# Одеса -> Херсон (2)
# Одеса -> Миколаїв (3)
# Житомир -> Вінниця (2)
# Вінниця -> Хмельницький (2)
# Хмельницький -> Тернопіль (2)
# Хмельницький -> Чернівці (3)
# Тернопіль -> Львів (2)
# Херсон -> Донецьк (4)
# Миколаїв -> Донецьк (4)
# Миколаїв -> Херсон (1)
# Полтава -> Кременчук (3)
# Полтава -> Черкаси (2)
# Черкаси -> Кропивницький (2)
# Черкаси -> Вінниця (3)
# Кременчук -> Дніпро (3)
# Кременчук -> Полтава (2)
# Донецьк -> Луганськ (2)
# Донецьк -> Харків (3)
# Донецьк -> Запоріжжя (2)
# Харків -> Суми (3)
# Луганськ -> Северодонецьк (2)
# Херсон -> Миколаїв (1)
# Донецьк -> Маріуполь (3)
# Запоріжжя -> Маріуполь (2)
# Львів -> Ужгород (4)
# Чернівці -> Ужгород (3)
# Тернопіль -> Івано-Франківськ (2)
# Івано-Франківськ -> Львів (3)
# Івано-Франківськ -> Чернівці (3)
# Кропивницький -> Черкаси (2)
# Кропивницький -> Полтава (2)
# Полтава -> Суми (3)
# Суми -> Кременчук (4)
# Суми -> Харків (4)
# Луганськ -> Харків (2)
# Луганськ -> Северодонецьк (2)
# Харків -> Полтава (2)
# Полтава -> Дніпро (3)
# Дніпро -> Одеса (3)
# Дніпро -> Запоріжжя (2)
# Запоріжжя -> Мелітополь (2)
# Запоріжжя -> Маріуполь (3)
# Маріуполь -> Донецьк (3)
# Херсон -> Миколаїв (1)
# Миколаїв -> Одеса (3)
# Хмельницький -> Вінниця (2)
# Вінниця -> Житомир (2)
# Житомир -> Київ (2)
# Тернопіль -> Львів (2)
# Львів -> Чернівці (4)
# Чернівці -> Вінниця (4)
# Чернівці -> Хмельницький (3)

# graph_delivery = {
#     'Київ': {'Львів': 3, 'Дніпро': 2, 'Одеса': 4},
#     'Львів': {'Київ': 3, 'Харків': 5, 'Житомир': 2, 'Чернівці': 4, 'Ужгород': 4, 'Тернопіль': 2},
#     'Дніпро': {'Київ': 2, 'Харків': 2, 'Донецьк': 3, 'Одеса': 3, 'Запоріжжя': 2, 'Полтава': 3, 'Кременчук': 3},
#     'Одеса': {'Київ': 4, 'Дніпро': 3, 'Херсон': 2, 'Миколаїв': 3},
#     'Харків': {'Київ': 5, 'Львів': 5, 'Дніпро': 2, 'Луганськ': 2, 'Полтава': 2, 'Суми': 3, 'Донецьк': 3},
#     'Житомир': {'Київ': 2, 'Львів': 2, 'Вінниця': 2},
#     'Чернівці': {'Львів': 4, 'Хмельницький': 3, 'Івано-Франківськ': 3, 'Ужгород': 3},
#     'Ужгород': {'Львів': 4, 'Чернівці': 3},
#     'Тернопіль': {'Львів': 2, 'Хмельницький': 2, 'Івано-Франківськ': 2},
#     'Херсон': {'Одеса': 2, 'Донецьк': 4, 'Миколаїв': 1},
#     'Миколаїв': {'Одеса': 3, 'Херсон': 1, 'Донецьк': 4},
#     'Полтава': {'Харків': 2, 'Дніпро': 3, 'Кременчук': 3, 'Черкаси': 2, 'Суми': 3},
#     'Луганськ': {'Харків': 2, 'Донецьк': 2, 'Северодонецьк': 2},
#     'Донецьк': {'Дніпро': 3, 'Харків': 3, 'Херсон': 4, 'Миколаїв': 4, 'Луганськ': 2, 'Маріуполь': 3, 'Запоріжжя': 2},
#     'Вінниця': {'Житомир': 2, 'Хмельницький': 2, 'Черкаси': 3, 'Чернівці': 4},
#     'Черкаси': {'Полтава': 2, 'Кропивницький': 2, 'Вінниця': 3},
#     'Кропивницький': {'Черкаси': 2, 'Полтава': 2},
#     'Кременчук': {'Полтава': 2, 'Дніпро': 3, 'Суми': 4},
#     'Запоріжжя': {'Дніпро': 2, 'Маріуполь': 3, 'Мелітополь': 2},
#     'Маріуполь': {'Донецьк': 3, 'Запоріжжя': 3},
#     'Мелітополь': {'Запоріжжя': 2},
#     'Северодонецьк': {'Луганськ': 2},
#     'Івано-Франківськ': {'Тернопіль': 2, 'Львів': 3, 'Чернівці': 3},
#     'Суми': {'Харків': 4, 'Полтава': 3, 'Кременчук': 4},
#     'Хмельницький': {"Вінниця": 2, "Чернівці": 3,"Тернопіль": 2}
# }

# distances, previous_nodes = dijkstra(graph_delivery, "Київ")
# path = get_path(previous_nodes, "Мелітополь")
# print(f"Час поїздки: {distances["Мелітополь"]} год")
# print(f"Шлях поїздки: {' -> '.join (path)}")

# network_devices = {
#     'RouterA': {
#         'RouterB': 3,
#         'Switch1': 1,
#         'RouterC': 5
#     },
#     'RouterB': {
#         'RouterA': 3,
#         'Switch2': 2,
#         'RouterD': 4
#     },
#     'RouterC': {
#         'RouterA': 5,
#         'Firewall': 1
#     },
#     'RouterD': {
#         'RouterB': 4,
#         'Switch3': 2
#     },
#     'Switch1': {'RouterA': 1, 'PC1': 1, 'PC2': 2},
#     'Switch2': {'RouterB': 2, 'PC3': 3, 'PC4': 1},
#     'Switch3': {'RouterD': 2, 'PC5': 1, 'PC6': 2},
#     'Firewall': {'RouterC': 1},
#     'PC1': {'Switch1': 1},
#     'PC2': {'Switch1': 2},
#     'PC3': {'Switch2': 3},
#     'PC4': {'Switch2': 1},
#     'PC5': {'Switch3': 1},
#     'PC6': {'Switch3': 2}
# }
# 'RouterA -> PC6'
# distances, previous_nodes = dijkstra(network_devices, "RouterA")
# path = get_path(previous_nodes, "PC6")
# print(f"Час поїздки: {distances["PC6"]} год")
# print(f"Шлях поїздки: {' -> '.join (path)}")


# graph_time = {
#     'Київ': {'Львів': 5, 'Харків': 3, 'Одеса': 4, 'Житомир': 2},
#     'Львів': {'Київ': 5, 'Івано-Франківськ': 3, 'Чернівці': 6, 'Ужгород': 4},
#     'Харків': {'Київ': 3, 'Дніпро': 3, 'Полтава': 2},
#     'Одеса': {'Київ': 4, 'Миколаїв': 2, 'Херсон': 3},
#     'Житомир': {'Київ': 2, 'Вінниця': 3, 'Луцьк': 4},
#     'Івано-Франківськ': {'Львів': 3, 'Чернівці': 2, 'Тернопіль': 4},
#     'Чернівці': {'Львів': 6, 'Івано-Франківськ': 2, 'Хмельницький': 5},
#     'Ужгород': {'Львів': 4},
#     'Дніпро': {'Харків': 3, 'Запоріжжя': 2, 'Кривий Ріг': 3, 'Полтава': 2},
#     'Полтава': {'Харків': 2, 'Дніпро': 2, 'Суми': 3},
#     'Вінниця': {'Житомир': 3, 'Хмельницький': 2, 'Кропивницький': 4},
#     'Хмельницький': {'Чернівці': 5, 'Вінниця': 2, 'Луцьк': 5},
#     'Луцьк': {'Житомир': 4, 'Хмельницький': 5, 'Рівне': 2},
#     'Запоріжжя': {'Дніпро': 2, 'Маріуполь': 4, 'Мелітополь': 2},
#     'Кривий Ріг': {'Дніпро': 3, 'Кропивницький': 3},
#     'Суми': {'Полтава': 3},
#     'Кропивницький': {'Вінниця': 4, 'Кривий Ріг': 3, 'Черкаси': 2},
#     'Черкаси': {'Кропивницький': 2, 'Кременчук': 2},
#     'Кременчук': {'Черкаси': 2, 'Полтава': 3},
#     'Маріуполь': {'Запоріжжя': 4},
#     'Мелітополь': {'Запоріжжя': 2},
#     'Херсон': {'Одеса': 3},
#     'Миколаїв': {'Одеса': 2},
#     'Тернопіль': {'Івано-Франківськ': 4},
#     'Рівне': {'Луцьк': 2}
# }
# distances, previous_nodes = dijkstra(graph_time, "Київ")
# # path = get_path(previous_nodes, "Кривий Ріг")
# # print(f"Час поїздки: {distances["Кривий Ріг"]} год")
# # print(f"Шлях поїздки: {' -> '.join (path)}")
# path = get_path(previous_nodes, "Маріуполь")
# print(f"Час поїздки: {distances["Маріуполь"]} год")
# print(f"Шлях поїздки: {' -> '.join (path)}")

# graph_network = {
#     'Client': {'Router_A': 4, 'Router_B': 7},
#     'Router_A': {'Client': 4, 'Router_C': 3, 'Router_D': 8},
#     'Router_B': {'Client': 7, 'Router_D': 2, 'Router_E': 6},
#     'Router_C': {'Router_A': 3, 'Router_D': 1, 'Server_Main': 9},
#     'Router_D': {'Router_A': 8, 'Router_B': 2, 'Router_C': 1, 'Router_E': 3, 'Server_Main': 4},
#     'Router_E': {'Router_B': 6, 'Router_D': 3, 'Server_Main': 2},
#     'Server_Main': {'Router_C': 9, 'Router_D': 4, 'Router_E': 2}
# }

# distances, previous_nodes = dijkstra(graph_network, "Client")
# path = get_path(previous_nodes, "Server_Main")
# print(f"Час поїздки: {distances["Server_Main"]} ms")
# print(f"Шлях поїздки: {' -> '.join (path)}")
# graph_flights = {
#     'KBP (Київ)': {'WAW (Варшава)': 70, 'IST (Стамбул)': 90, 'FRA (Франкфурт)': 140},
#     'WAW (Варшава)': {'KBP (Київ)': 70, 'LHR (Лондон)': 45, 'FRA (Франкфурт)': 50, 'CDG (Париж)': 60},
#     'IST (Стамбул)': {'KBP (Київ)': 90, 'DXB (Дубай)': 120, 'FRA (Франкфурт)': 110, 'JFK (Нью-Йорк)': 450},
#     'FRA (Франкфурт)': {'KBP (Київ)': 140, 'WAW (Варшава)': 50, 'IST (Стамбул)': 110, 'JFK (Нью-Йорк)': 320, 'CDG (Париж)': 40},
#     'CDG (Париж)': {'WAW (Варшава)': 60, 'FRA (Франкфурт)': 40, 'JFK (Нью-Йорк)': 280, 'LHR (Лондон)': 35},
#     'LHR (Лондон)': {'WAW (Варшава)': 45, 'CDG (Париж)': 35, 'JFK (Нью-Йорк)': 260},
#     'DXB (Дубай)': {'IST (Стамбул)': 120, 'JFK (Нью-Йорк)': 500},
#     'JFK (Нью-Йорк)': {'FRA (Франкфурт)': 320, 'CDG (Париж)': 280, 'LHR (Лондон)': 260, 'IST (Стамбул)': 450, 'DXB (Дубай)': 500}
# }


# Гравець або юніт пересувається картою. Різні типи рельєфу вимагають різної
# кількості очок руху (Move Points):
# Дорога = 1, Трава = 2, Ліс = 4, Болото = 7, Гори = 10.

graph_game_map = {
    'База': {'Торговий_тракт': 1, 'Луки': 2, 'Темний_ліс': 4},
    'Торговий_тракт': {'База': 1, 'Міст': 1, 'Гірський_перевал': 10},
    'Луки': {'База': 2, 'Гниле_болото': 7, 'Міст': 2},
    'Темний_ліс': {'База': 4, 'Гниле_болото': 7, 'Печера_дракона': 8},
    'Міст': {'Торговий_тракт': 1, 'Луки': 2, 'Фортеця': 2},
    'Гниле_болото': {'Луки': 7, 'Темний_ліс': 7, 'Печера_дракона': 3},
    'Гірський_перевал': {'Торговий_тракт': 10, 'Фортеця': 3},
    'Фортеця': {'Міст': 2, 'Гірський_перевал': 3, 'Печера_дракона': 4},
    'Печера_дракона': {'Темний_ліс': 8, 'Гниле_болото': 3, 'Фортеця': 4}
}

distances, previous_nodes = dijkstra(graph_game_map, "База")
path = get_path(previous_nodes, "Печера_дракона")
print(f"Час поїздки: {distances["Печера_дракона"]} очок руху")
print(f"Шлях поїздки: {' -> '.join (path)}")